; domain
(define (domain p2)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))    
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
    )
)
)

; problem
(define (problem problem1) (:domain p2)
(:objects 
    drone1 - drone
    crate1 - crate
    crate2 - crate
    crate3 - crate
    carrier1 - carrier
    person1 - person
    person2 - person
    N0 N1 N2 N3 N4 N5 N6 N7 - num
    space1 space2 space3 space4 - carrier_space
    room1 depot - location
    food medicine - content
)

(:init
    (person-at person1 room1)
    (person-at person2 room1)
    (crate-at crate1 depot)
    (crate-at crate2 depot)
    (crate-at crate3 depot)
    (content-crate food crate1)
    (content-crate medicine crate2)
    (content-crate food crate3)
    (drone-at drone1 depot)
    (carrier-at carrier1 depot)

    (empty-space carrier1 space1)
    (empty-space carrier1 space2)
    (empty-space carrier1 space3)
    (empty-space carrier1 space4)

    (next N0 N1)
    (next N1 N2)
    (next N2 N3)
    (next N3 N4)
    (next N4 N5)
    (next N5 N6)
    (next N6 N7)


)

(:goal (and
   (has-content-person person1 food)
   (has-content-person person2 medicine)
))

(:metric minimize (total-cost))
)

; plan
1. (put-crate-in-carrier crate1 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space4)
   goals met: 0 of 2
2. (put-crate-in-carrier crate2 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space3)
   goals met: 0 of 2
3. (move-carrier depot room1 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 room1) (carrier-at carrier1 room1)
   goals met: 0 of 2
4. (pick-and-drop crate1 room1 drone1 carrier1 space4 person1 food)
   deleted: (crate-at-space crate1 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person1 food)
   goals met: 1 of 2
5. (pick-and-drop crate2 room1 drone1 carrier1 space3 person2 medicine)
   deleted: (crate-at-space crate2 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person2 medicine)
   goals met: 2 of 2
